// + - / * % **

// 0.1 + 0.2 === 0.3; // false
// console.log(0.1 + 0.2);  // 0.30000000000000000000004 

// a = 'd' - присваивание let a = 5; let d = '5';
// a == d - сравнение (по значению) => let a = 5; let d = '5'; будет true
// a === d - строгое сравнение (не только по значению, но и по типу данных) => let a = 5; let d = '5'; будет false

// Метод Math.ceil() - округление вверх. Округляет аргумент до ближайшего большего целого
// Метод Math.floor() - округление вниз. Округляет аргумент до ближайшего меньшего целого
// Метод Math.round() возвращает число, округлённое к ближайшему целому
// Метод Math.pow() возвращает основание, возведённое в степень показатель (Math.pow(base, exponent))

// incr++; // сначала берёт старое значение, потом увеличивает
// decr--; // сначала берёт старое значение, потом уменьшает
// ++incr; // старое значение увеличивается сразу
// --decr; // старое значение уменьшается сразу

// Всё, что возвращает false: null, 0, '', Nan, undefined;

/**
 * if (cond) {
 *  do something
 * } else if (cond1) {
 *  do something
 * } else {
 *  do something
 * }
 */

/**
 * if (cond) do something
 * else do
 */

// a !== b ? do1 : do2
